testCases/CF_590/0.orig/T1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volSymmTensorField;
    location    "43892";
    object      T1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
400
(
(0 7.95773e-05 0 -6.54995e-13 0 0)
(0 0.000482508 0 -1.82593e-12 0 0)
(0 0.00141184 0 -1.81423e-12 0 0)
(0 0.00297566 0 -2.49856e-11 0 0)
(0 0.00522211 0 -1.3904e-10 0 0)
(0 0.00818024 0 -6.16247e-10 0 0)
(0 0.0118698 0 -2.40616e-09 0 0)
(0 0.0163021 0 -8.38929e-09 0 0)
...
)
;

boundaryField
{
    topWall
    {
        type            symmetry;
    }
    bottomWall
    {
        type            calculated;
        value           uniform (0 7.95925e-05 0 -6.41295e-13 0 0);
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
