testCases/CF_590/0.orig/T2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volSymmTensorField;
    location    "43892";
    object      T2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
400
(
(-1.26651e-08 5.21227e-17 0 1.26651e-08 0 0)
(-4.65629e-07 8.81027e-16 0 4.65629e-07 0 0)
(-3.98656e-06 2.56139e-15 0 3.98656e-06 0 0)
(-1.77091e-05 7.43486e-14 0 1.77091e-05 0 0)
(-5.45409e-05 7.2608e-13 0 5.45409e-05 0 0)
(-0.000133833 5.04105e-12 0 0.000133833 0 0)
(-0.000281784 2.85606e-11 0 0.000281784 0 0)
(-0.000531515 1.36763e-10 0 0.000531515 0 0)
...
)
;

boundaryField
{
    topWall
    {
        type            symmetry;
    }
    bottomWall
    {
        type            calculated;
        value           uniform (-1.26699e-08 5.10423e-17 0 1.26699e-08 0 0);
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
