testCases/CF_590/0.orig/T3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volSymmTensorField;
    location    "43892";
    object      T3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
400
(
(2.11085e-09 -5.21227e-17 0 2.11085e-09 0 -4.22169e-09)
(7.76048e-08 -8.81027e-16 0 7.76048e-08 0 -1.5521e-07)
(6.64427e-07 -2.56139e-15 0 6.64427e-07 0 -1.32885e-06)
(2.95151e-06 -7.43486e-14 0 2.95151e-06 0 -5.90303e-06)
(9.09014e-06 -7.2608e-13 0 9.09014e-06 0 -1.81803e-05)
(2.23054e-05 -5.04105e-12 0 2.23054e-05 0 -4.46109e-05)
(4.6964e-05 -2.85606e-11 0 4.6964e-05 0 -9.39281e-05)
(8.85859e-05 -1.36763e-10 0 8.85859e-05 0 -0.000177172)
...
)
;

boundaryField
{
    topWall
    {
        type            symmetry;
    }
    bottomWall
    {
        type            calculated;
        value           uniform (2.11166e-09 -5.10423e-17 0 2.11166e-09 0 -4.22331e-09);
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
