testCases/CF_590/0.orig/T5
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volSymmTensorField;
    location    "43892";
    object      T5;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
400
(
(-8.29556e-21 0 0 8.29556e-21 0 0)
(-8.50206e-19 0 0 8.50206e-19 0 0)
(-7.23253e-18 0 0 7.23253e-18 0 0)
(-4.42472e-16 0 0 4.42472e-16 0 0)
(-7.58334e-15 1.04164e-22 0 7.58334e-15 0 0)
(-8.24739e-14 3.12737e-21 0 8.24739e-14 0 0)
(-6.78017e-13 6.89559e-20 0 6.78017e-13 0 0)
(-4.45904e-12 1.14735e-18 0 4.45904e-12 0 0)
...
)
;

boundaryField
{
    topWall
    {
        type            symmetry;
    }
    bottomWall
    {
        type            calculated;
        value           uniform (-8.12516e-21 0 0 8.12516e-21 0 0);
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
