testCases/CF_590/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "43892";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
400
(
(0.112877 -4.54737e-10 0)
(0.339857 -1.40859e-09 0)
(0.56939 -1.31241e-09 0)
(0.801503 -1.70803e-09 0)
(1.03622 -3.27906e-09 0)
(1.27357 -8.01052e-09 0)
(1.51356 -2.13078e-08 0)
(1.75619 -5.70559e-08 0)
...
)
;

boundaryField
{
    topWall
    {
        type            symmetry;
    }
    bottomWall
    {
        type            noSlip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
