testCases/CF_590/0.orig/dBij
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volSymmTensorField;
    location    "43892";
    object      dBij;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
400
(
(1.09753e-09 -3.76748e-18 0 -1.09753e-09 0 0)
(4.03586e-08 -6.10594e-17 0 -4.03586e-08 0 0)
(3.46071e-07 -2.83527e-16 0 -3.46071e-07 0 0)
(1.54655e-06 -6.47916e-15 0 -1.54655e-06 0 0)
(4.8395e-06 -6.44348e-14 0 -4.8395e-06 0 0)
(1.22787e-05 -4.62507e-13 0 -1.22787e-05 0 0)
(2.74382e-05 -2.78102e-12 0 -2.74382e-05 0 0)
(5.68028e-05 -1.46158e-11 0 -5.68028e-05 0 0)
...
)
;

boundaryField
{
    topWall
    {
        type            symmetry;
    }
    bottomWall
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0);
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
