testCases/CF_590/0.orig/i5
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "43892";
    object      i5;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
400
(
-8.02021e-17
-1.08405e-13
-7.94635e-12
-1.56806e-10
-1.48735e-09
-8.95558e-09
-3.97012e-08
-1.41254e-07
...
)
;

boundaryField
{
    topWall
    {
        type            symmetry;
    }
    bottomWall
    {
        type            calculated;
        value           uniform -8.02636e-17;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
