testCases/CF_590/0.orig/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "43892";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<scalar> 
399
(
-1.20699e-13
-1.20734e-13
-1.20779e-13
-1.20832e-13
-1.20893e-13
-1.20961e-13
-1.21034e-13
-1.21109e-13
...
)
;

boundaryField
{
    topWall
    {
        type            symmetry;
        value           uniform 0;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
400
(
-4.32296e-07
-1.31673e-06
-2.23171e-06
-3.17802e-06
-4.15652e-06
-5.16802e-06
-6.21335e-06
-7.29331e-06
...
)
;
    }
    outlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
400
(
4.32296e-07
1.31673e-06
2.23171e-06
3.17802e-06
4.15652e-06
5.16802e-06
6.21335e-06
7.29331e-06
...
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform List<scalar> 0();
    }
}


// ************************************************************************* //
