testCases/CF_590/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    topWall
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          1;
        startFace       399;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       400;
    }
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       401;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       801;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          800;
        startFace       1201;
    }
)

// ************************************************************************* //
