testCases/CF_590/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 100 0)
    (0 100 0)
    (0 0 1)
    (1 0 1)
    (1 100 1)
    (0 100 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 400 1) simpleGrading 
    (
        1                  // x-direction expansion ratio
        (
            (0.3 0.5 10)    // 20% y-dir, 30% cells, expansion = 4
            (0.7 0.5 1)    // 60% y-dir, 40% cells, expansion = 1
        )
        1                  // z-direction expansion ratio
    )
);

edges
(
);

boundary
(
    topWall
    {
        type symmetry;
        faces
        (
            (3 7 6 2)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }

    inlet
    {
        type cyclic;
        neighbourPatch  outlet;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type cyclic;
        neighbourPatch  inlet;
        faces
        (
            (2 6 5 1)
        );
    }


    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
