testCases/CF_590/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-12;
        relTol          0.1;
    }

    "(U|k|epsilon|omega|nuTilda|phit)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0.1;
    }
}

SIMPLE
{

    residualControl
    {
        "(k|epsilon)" 5e-08;
    }
    nNonOrthogonalCorrectors 0;
	pRefCell	0;
	pRefValue		0;
    consistent          yes;
}

relaxationFactors
{
    equations
    {
        U               0.9;
        "(k|epsilon|omega|nuTilda|phit|f)" 0.7;
		p				0.4;
    }
}

// ************************************************************************* //
